// Задания для 5 – го урока (начальный уровень)
// Напишите программу, которая используя конструкцию циклов выводит числа от 1 до 10.
// package main

// import "fmt"

// func main() {
// 	numPrint()
// }
// func numPrint()  {
// 	for i := 0; i < 10; i++ {
// 		fmt.Print(i, " ")
// 	}
// }
//-------------------------------------------------------------------------------------------------
// package main

// import "fmt"

// func main() {
// 	numPrint()
// }
// func numPrint()  {
// 	i:=0
// 	for i = 0; i < 10; i++ {
// 		fmt.Println(i)
// 	}
// 	fmt.Println(i)
// }

// -------------------------------------------------------------------------------------------------
// Напишите программу, которая используя конструкцию циклов выводит квадраты чисел от 1 до 5.
// package main

// import "fmt"

//	func main() {
//		numbersSquare()
//	}
//
//	func numbersSquare() {
//		for i := 1; i <= 5; i++ {
//			fmt.Print(i*i," ")
//		}
//	}
//
// -------------------------------------------------------------------------------------------------
// Напишите программу, которая выводит таблицу умножения на 3 от 1 до 10.
// package main

// import "fmt"

//	func main() {
//		Multiplier()
//	}
//
//	func Multiplier()  {
//		j:=3
//		for i := 1; i <= 10; i++ {
//			fmt.Printf("%v x %v = %v\n",j,i,j*i)
//		}
//	}
//
// -------------------------------------------------------------------------------------------------
// Напишите программу, которая выводит первые 10 чисел последовательности Фибоначчи.
// package main

// import "fmt"

// func main() {
// 	var f1,f2,f3 int
// 	f1,f2=1,1
// 	fmt.Print(f1," ",f2," ")
// 	for i := 3; i <= 10; i++ {
// 		f3=f2+f1
// 		f1=f2
// 		f2=f3
// 		fmt.Print(f3," ")

//		}
//	}
//
// -------------------------------------------------------------------------------------------------
// Напишите программу,
// которая находит наибольший общий делитель (НОД) двух чисел,
// используя алгоритм Евклида.
// package main

// import "fmt"

// func main() {
// 	a := 25
// 	b := 50

// 	fmt.Println(evklid(a, b))
// }

//	func evklid(a, b int) int {
//		if a < b {
//			c := a
//			d := b
//			a = d
//			b = c
//		}
//		r := a % b
//		if r == 0 {
//			return b
//		} else {
//			return evklid(b, r)
//		}
//	}
//
// -------------------------------------------------------------------------------------------------
// Напишите программу, которая
// выводит числа от 1 до 100,
// заменяя числа, кратные 3, на "Fizz",
// числа, кратные 5, на "Buzz", а
// числа, кратные 3 и 5, на "FizzBuzz".
// package main

// import "fmt"

// func main() {
// 	FizzBuzz()
// }

// func FizzBuzz() {
// 	for i := 1; i <= 100; i++ {
// 		if i%3 == 0 && i%5 == 0 {
// 			fmt.Print("Fizz"," ")
// 		} else if i%3 == 0 {
// 			fmt.Print("Buzz"," ")
// 		} else if i%5 == 0 {
// 			fmt.Print("FizzBuzz"," ")
// 		} else {
// 			fmt.Print(i," ")
// 		}
// 	}
// }

// -------------------------------------------------------------------------------------------------
//Напишите программу, которая проверяет, является ли число простым.
// package main

// import (
// 	"fmt"
// )

// func isPrime(n int) bool {
// 	if n <= 1 {
// 		return false
// 	}
// 	for i := 2; i*i <= n; i++ {
// 		if n%i == 0 {
// 			return false
// 		}
// 	}
// 	return true
// }

//	func main() {
//		// Пример использования функции для проверки чисел от 1 до 20
//		for number := 1; number <= 20; number++ {
//			if isPrime(number) {
//				fmt.Printf("%d является простым числом.\n", number)
//			} else {
//				fmt.Printf("%d не является простым числом.\n", number)
//			}
//		}
//	}
//
// -------------------------------------------------------------------------------------------------
// Напишите программу, которая выводит все делители числа.
// package main

// import "fmt"

//	func main() {
//		findAllDivisors(20)
//	}
//
//	func findAllDivisors(n int){
//		for i := 1; i <= n; i++ {
//			if n%i == 0 {
//				fmt.Print(i," ")
//			}
//		}
//	}
//
// -------------------------------------------------------------------------------------------------
// Напишите программу, которая находит сумму цифр числа.
// package main

// import "fmt"

// func main() {
//   var a, b, S int
//   fmt.Scan(&a)
//   for a != 0 {
//     b = a % 10
//     a = a / 10
//     S = S + b
//   }
//   fmt.Println(S)
// }
// -------------------------------------------------------------------------------------------------
// Напишите программу, которая запрашивает у пользователя ввод
// положительного числа и повторяет запрос, пока не будет введено
// положительное число.
// package main

// import "fmt"

// func main() {
// 	askForPositiveNumber()
// }
// func askForPositiveNumber() {
// 	for {
// 		var number int
// 		fmt.Print("Please input positive number:")
// 		fmt.Scan(&number)
// 		if number > 0 {
// 			fmt.Println(number)
// 			break
// 		} else {
// 			continue
// 		}
// 	}

// }
// -------------------------------------------------------------------------------------------------
// Напишите программу, которая вычисляет
// произведение всех чисел
// от 1 до введённого числа n, но прекращает выполнение, если результат превышает 1000.
// package main

// import "fmt"

// func main() {
// 	var n, a int
// 	p := 1
// 	fmt.Scan(&n)
// 	for i := 1; i <= n; i++ {
// 		if p > 1000 {
// 			break
// 		}
// 		a = p
// 		p = p * i
// 	}
// 	if p > 1000 {
// 		fmt.Println(a)
// 	} else {
// 		fmt.Println(p)
// 	}

// }
// -------------------------------------------------------------------------------------------------
// Напишите программу, которая запрашивает у пользователя ввод числа и проверяет, 
// является ли оно палиндромом.
package main

import (
  "fmt"
)

func main() {
  var a int

  fmt.Scan(&a)

  fmt.Println(Palindrome(a))
}

func Palindrome(a int) bool {
  var b, c int
  p := 0
  c = a
  for a != 0 {
    b = a % 10
    a = a / 10
    p = p*10+b
  }

  return c == p
}